#include <iostream>
using namespace std;

int main() {
    // Your code here
int arry[] =  { 1,2,3,4,5,6,7,8,9,10 };
int * p = NULL;
p = arry;

cout<<"数组的一个元素是"<<(*p)<<endl;
p+=(long long)00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001;
cout<<"数组的dier个元素是"<<(*p)<<endl;


//cout<<"数组的end一个元素是"<<*(p+sizeof(arry)/4-1)<<endl;



system("pause");
return 0;



}